#برنامه محاسبه اسامی و کلمات به حروف ابجد(کبیر یا جمل)
def ABJD(txt):
	characters = {
		"ا":1,
		"ب":2,
		"ج":3,
		"د":4,
		"ه":5,
		"و":6,
		"ز":7,
		"ح":8,
		"ط":9,
		"ی":10,
		"ک":20,
		"ل":30,
		"م":40,
		"ن":50,
		"س":60,
		"ع":70,
		"ف":80,
		"ص":90,
		"ق":100,
		"ر":200,
		"ش":300,
		"ت":400,
		"ث":500,
		"خ":600,
		"ذ":700,
		"ض":800,
		"ظ":900,
		"غ":1000,
		"پ":2,
		"چ":3,
		"ژ":7,
		"گ":20,
		" ": 0,
		".": 0,
		",": 0,
		"،": 0,
		"?": 0,
		"؟": 0,
		"!": 0,
		":": 0,
		"؛": 0,
		"آ": 1,
		"ؤ": 6,
		"ئ": 10,
		"ء": 0,
		"أ": 1,
		"إ": 1,
		"ي": 10,
		"ة": 5,
		"َ": 0,
		"ُ": 0,
		"ِ": 0,
		"ّ": 0,
		"ۀ": 5,
		"ً": 0,
		"ٌ": 0,
		"ٍ": 0,
	}
	numberlist = []
	for character in txt:
		if character in characters:
			number = characters[character]
			numberlist.append(number)
			plus = sum(numberlist)
		else:
			return ('لطفا فقط حروف فارسی وارد نمایید.')
	return('محاسبه حروف: ' + str(txt) + ' به ابجد برابر است با: ' + str(plus))

document  = input("حرف، کلمه یا متن مورد نظر خویش را اینجا بنویسید تا این برنامه عدد معادل آن را بر اساس حروف ابجد محاسبه کرده و به شما خروجی دهد.")
print(ABJD(document))